RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/inc/ht32f5xxxx_pdma.h
#define PDMA_ADC0                 PDMA_CH0                      /*!< ADC PDMA channel number                */
#if (LIBCFG_ADC1)
#define PDMA_ADC1                 PDMA_CH1                      /*!< ADC PDMA channel number                */
#endif
#define PDMA_ADC                  PDMA_ADC0

#if(LIBCFG_DAC0)
#define PDMA_DAC0_CH0             PDMA_CH1                      /*!< DAC0 CH0 PDMA channel number           */
#define PDMA_DAC0_CH1             PDMA_CH3                      /*!< DAC0 CH1 PDMA channel number           */
#endif

#if(LIBCFG_DAC1)
#define PDMA_DAC1_CH0             PDMA_CH4                      /*!< DAC1 CH0 PDMA channel number           */
#define PDMA_DAC1_CH1             PDMA_CH5                      /*!< DAC1 CH1 PDMA channel number           */
#endif

#if defined(USE_HT32F65230_40) || defined(USE_HT32F65232) || defined(USE_HT32F0006) || defined(USE_HT32F61244_45) || defined(USE_HT32F66242) || defined (USE_HT32F66246)
#define PDMA_SPI0_RX              PDMA_CH4                      /*!< SPI0_RX PDMA channel number            */
#define PDMA_SPI0_TX              PDMA_CH5                      /*!< SPI0_TX PDMA channel number            */
#elif defined(USE_HT32F57342_52) || defined(USE_HT32F52357_67) || defined(USE_HT32F67041_51) || defined(USE_HT32F52234_44)
#define PDMA_SPI0_RX              PDMA_CH2                      /*!< SPI0_RX PDMA channel number            */
#define PDMA_SPI0_TX              PDMA_CH3                      /*!< SPI0_TX PDMA channel number            */
#else
#define PDMA_SPI0_RX              PDMA_CH0                      /*!< SPI0_RX PDMA channel number            */
#define PDMA_SPI0_TX              PDMA_CH1                      /*!< SPI0_TX PDMA channel number            */
#endif

#if (LIBCFG_SPI1)
#define PDMA_SPI1_RX              PDMA_CH4                      /*!< SPI1_RX PDMA channel number            */
#define PDMA_SPI1_TX              PDMA_CH5                      /*!< SPI1_TX PDMA channel number            */
#endif

#if (LIBCFG_QSPI)
#define PDMA_QSPI_TX              PDMA_CH1                      /*!< QSPI_TX PDMA channel number            */
#define PDMA_QSPI_RX              PDMA_CH0                      /*!< QSPI_RX PDMA channel number            */
#endif

#define PDMA_USART0_RX            PDMA_CH0                      /*!< USART0_RX PDMA channel number          */
#define PDMA_USART0_TX            PDMA_CH1                      /*!< USART0_TX PDMA channel number          */
#if (LIBCFG_USART1)
#define PDMA_USART1_RX            PDMA_CH2                      /*!< USART1_RX PDMA channel number          */
#define PDMA_USART1_TX            PDMA_CH3                      /*!< USART1_TX PDMA channel number          */
#endif

#if defined(USE_HT32F52243_53) || defined(USE_HT32F52357_67) || defined(USE_HT32F54243_53)
#define PDMA_UART2_RX             PDMA_CH0                      /*!< UART2_RX PDMA channel number           */
#define PDMA_UART2_TX             PDMA_CH1                      /*!< UART2_TX PDMA channel number           */
#define PDMA_UART3_RX             PDMA_CH4                      /*!< UART3_RX PDMA channel number           */
#define PDMA_UART3_TX             PDMA_CH5                      /*!< UART3_TX PDMA channel number           */
#endif

#define PDMA_UART0_RX             PDMA_CH2                      /*!< UART0_RX PDMA channel number           */
#define PDMA_UART0_TX             PDMA_CH3                      /*!< UART0_TX PDMA channel number           */
#if (LIBCFG_UART1)
#define PDMA_UART1_RX             PDMA_CH4                      /*!< UART1_RX PDMA channel number           */
#define PDMA_UART1_TX             PDMA_CH5                      /*!< UART1_TX PDMA channel number           */
#endif

#if defined(USE_HT32F65230_40) || defined(USE_HT32F65232)
#define PDMA_I2C0_RX              PDMA_CH2                      /*!< I2C0_RX PDMA channel number            */
#define PDMA_I2C0_TX              PDMA_CH3                      /*!< I2C0_TX PDMA channel number            */
#elif defined(USE_HT32F52234_44)
#define PDMA_I2C0_RX              PDMA_CH2                      /*!< I2C0_RX PDMA channel number            */
#define PDMA_I2C0_TX              PDMA_CH0                      /*!< I2C0_TX PDMA channel number            */
#else
#define PDMA_I2C0_RX              PDMA_CH2                      /*!< I2C0_RX PDMA channel number            */
#define PDMA_I2C0_TX              PDMA_CH4                      /*!< I2C0_TX PDMA channel number            */
#endif
#if (LIBCFG_I2C1)
#if defined(USE_HT32F52234_44)
#define PDMA_I2C1_RX              PDMA_CH3                      /*!< I2C1_RX PDMA channel number            */
#define PDMA_I2C1_TX              PDMA_CH1                      /*!< I2C1_TX PDMA channel number            */
#else
#define PDMA_I2C1_RX              PDMA_CH3                      /*!< I2C1_RX PDMA channel number            */
#define PDMA_I2C1_TX              PDMA_CH5                      /*!< I2C1_TX PDMA channel number            */
#endif
#endif

#if (LIBCFG_I2C2)
#if defined(USE_HT32F52243_53) || defined(USE_HT32F54243_53)
#define PDMA_I2C2_RX              PDMA_CH0                      /*!< I2C2_RX PDMA channel number            */
#define PDMA_I2C2_TX              PDMA_CH1                      /*!< I2C2_TX PDMA channel number            */
#elif defined(USE_HT32F52234_44)
#define PDMA_I2C2_RX              PDMA_CH4                      /*!< I2C2_RX PDMA channel number            */
#define PDMA_I2C2_TX              PDMA_CH5                      /*!< I2C2_TX PDMA channel number            */
#endif
#endif

#if defined(USE_HT32F52342_52) || defined(USE_HT32F5826) || defined(USE_HT32F57342_52) || defined(USE_HT32F52357_67)
#define PDMA_SCI0_TX              PDMA_CH5                      /*!< SCI0_TX PDMA channel number            */
#define PDMA_SCI0_RX              PDMA_CH4                      /*!< SCI0_RX PDMA channel number            */
#define PDMA_SCI1_TX              PDMA_CH3                      /*!< SCI1_TX PDMA channel number            */
#define PDMA_SCI1_RX              PDMA_CH2                      /*!< SCI1_RX PDMA channel number            */
#endif

