RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/inc/ht32f5xxxx_pdma.h
#if (LIBCFG_I2S)
#define PDMA_I2S_TX               PDMA_CH2                      /*!< I2S_TX PDMA channel number             */
#define PDMA_I2S_RX               PDMA_CH1                      /*!< I2S_RX PDMA channel number             */
#endif

#if (LIBCFG_MCTM0)
#define PDMA_MCTM0_CH0            PDMA_CH0                      /*!< MCTM0_CH0 PDMA channel number          */
#define PDMA_MCTM0_TRIG           PDMA_CH1                      /*!< MCTM0_TRIG PDMA channel number         */
#define PDMA_MCTM0_CH1            PDMA_CH2                      /*!< MCTM0_CH1 PDMA channel number          */
#define PDMA_MCTM0_CH2            PDMA_CH3                      /*!< MCTM0_CH2 PDMA channel number          */
#define PDMA_MCTM0_CH3            PDMA_CH4                      /*!< MCTM0_CH3 PDMA channel number          */
#define PDMA_MCTM0_UEV2           PDMA_CH4                      /*!< MCTM0_UEV2 PDMA channel number         */
#define PDMA_MCTM0_UEV1           PDMA_CH5                      /*!< MCTM0_UEV1 PDMA channel number         */
#endif

#if (LIBCFG_NO_GPTM0)
#else
#if defined(USE_HT32F65230_40) || defined(USE_HT32F65232) || defined(USE_HT32F66242) || defined (USE_HT32F66246)
#define PDMA_GPTM0_CH1            PDMA_CH0                      /*!< GPTM0_CH1 PDMA channel number          */
#define PDMA_GPTM0_CH2            PDMA_CH1                      /*!< GPTM0_CH2 PDMA channel number          */
#define PDMA_GPTM0_CH0            PDMA_CH2                      /*!< GPTM0_CH0 PDMA channel number          */
#define PDMA_GPTM0_CH3            PDMA_CH3                      /*!< GPTM0_CH3 PDMA channel number          */
#define PDMA_GPTM0_UEV            PDMA_CH4                      /*!< GPTM0_UEV PDMA channel number          */
#define PDMA_GPTM0_TRIG           PDMA_CH5                      /*!< GPTM0_TRIG PDMA channel number         */
#else
#define PDMA_GPTM0_CH1            PDMA_CH0                      /*!< GPTM0_CH1 PDMA channel number          */
#define PDMA_GPTM0_CH3            PDMA_CH0                      /*!< GPTM0_CH3 PDMA channel number          */
#define PDMA_GPTM0_CH2            PDMA_CH1                      /*!< GPTM0_CH2 PDMA channel number          */
#define PDMA_GPTM0_UEV            PDMA_CH1                      /*!< GPTM0_UEV PDMA channel number          */
#define PDMA_GPTM0_CH0            PDMA_CH2                      /*!< GPTM0_CH0 PDMA channel number          */
#define PDMA_GPTM0_TRIG           PDMA_CH2                      /*!< GPTM0_TRIG PDMA channel number         */
#endif
#endif

#if (LIBCFG_GPTM1)
#define PDMA_GPTM1_CH0            PDMA_CH3                      /*!< GPTM1_CH0 PDMA channel number          */
#define PDMA_GPTM1_CH3            PDMA_CH3                      /*!< GPTM1_CH3 PDMA channel number          */
#define PDMA_GPTM1_CH1            PDMA_CH4                      /*!< GPTM1_CH1 PDMA channel number          */
#define PDMA_GPTM1_UEV            PDMA_CH4                      /*!< GPTM1_UEV PDMA channel number          */
#define PDMA_GPTM1_CH2            PDMA_CH5                      /*!< GPTM1_CH2 PDMA channel number          */
#define PDMA_GPTM1_TRIG           PDMA_CH5                      /*!< GPTM1_TRIG PDMA channel number         */
#endif

#if defined(USE_HT32F65230_40) || defined(USE_HT32F65232) || defined(USE_HT32F66242) || defined (USE_HT32F66246)
#define PDMA_SCTM0_CH0            PDMA_CH0                      /*!< SCTM0_CH0 PDMA channel number          */
#define PDMA_SCTM0_CH1            PDMA_CH1                      /*!< SCTM0_CH1 PDMA channel number          */
#define PDMA_SCTM1_CH0            PDMA_CH2                      /*!< SCTM1_CH0 PDMA channel number          */
#define PDMA_SCTM1_CH1            PDMA_CH3                      /*!< SCTM1_CH1 PDMA channel number          */
#define PDMA_SCTM2_CH0            PDMA_CH4                      /*!< SCTM2_CH0 PDMA channel number          */
#define PDMA_SCTM2_CH1            PDMA_CH5                      /*!< SCTM2_CH1 PDMA channel number          */
#define PDMA_SCTM3_CH0            PDMA_CH4                      /*!< SCTM3_CH0 PDMA channel number          */
#define PDMA_SCTM3_CH1            PDMA_CH5                      /*!< SCTM3_CH1 PDMA channel number          */
#endif

#if (LIBCFG_PWM0)
#if defined(USE_HT32F52234_44)
#define PDMA_PWM0_CH0             PDMA_CH5                      /*!< PWM0_CH0 PDMA channel number           */
#define PDMA_PWM0_CH1             PDMA_CH3                      /*!< PWM0_CH1 PDMA channel number           */
#define PDMA_PWM0_CH2             PDMA_CH4                      /*!< PWM0_CH2 PDMA channel number           */
#define PDMA_PWM0_CH3             PDMA_CH3                      /*!< PWM0_CH3 PDMA channel number           */
#define PDMA_PWM0_TRIG            PDMA_CH5                      /*!< PWM0_TRIG PDMA channel number          */
#define PDMA_PWM0_UEV             PDMA_CH4                      /*!< PWM0_UEV PDMA channel number           */
#else
#define PDMA_PWM0_CH0             PDMA_CH2                      /*!< PWM0_CH0 PDMA channel number           */
#define PDMA_PWM0_CH1             PDMA_CH0                      /*!< PWM0_CH1 PDMA channel number           */
#define PDMA_PWM0_CH2             PDMA_CH1                      /*!< PWM0_CH2 PDMA channel number           */
#define PDMA_PWM0_CH3             PDMA_CH0                      /*!< PWM0_CH3 PDMA channel number           */
#define PDMA_PWM0_TRIG            PDMA_CH2                      /*!< PWM0_TRIG PDMA channel number          */
#define PDMA_PWM0_UEV             PDMA_CH1                      /*!< PWM0_UEV PDMA channel number           */
#endif
#endif

#if (LIBCFG_PWM1)
#define PDMA_PWM1_CH0             PDMA_CH5                      /*!< PWM1_CH0 PDMA channel number           */
#define PDMA_PWM1_CH1             PDMA_CH3                      /*!< PWM1_CH1 PDMA channel number           */
#define PDMA_PWM1_CH2             PDMA_CH4                      /*!< PWM1_CH2 PDMA channel number           */
#define PDMA_PWM1_CH3             PDMA_CH3                      /*!< PWM1_CH3 PDMA channel number           */
#define PDMA_PWM1_TRIG            PDMA_CH5                      /*!< PWM1_TRIG PDMA channel number          */
#define PDMA_PWM1_UEV             PDMA_CH4                      /*!< PWM1_UEV PDMA channel number           */
#endif

#if (LIBCFG_PWM2)
#define PDMA_PWM2_CH0             PDMA_CH5                      /*!< PWM2_CH0 PDMA channel number           */
#define PDMA_PWM2_CH1             PDMA_CH3                      /*!< PWM2_CH1 PDMA channel number           */
#define PDMA_PWM2_CH2             PDMA_CH4                      /*!< PWM2_CH2 PDMA channel number           */
#define PDMA_PWM2_CH3             PDMA_CH3                      /*!< PWM2_CH3 PDMA channel number           */
#define PDMA_PWM2_TRIG            PDMA_CH5                      /*!< PWM2_TRIG PDMA channel number          */
#define PDMA_PWM2_UEV             PDMA_CH4                      /*!< PWM2_UEV PDMA channel number           */
#endif

#if (LIBCFG_SLED0)
#define PDMA_SLED0                PDMA_CH0                      /*!< SLED0 PDMA channel number              */
#endif
#if (LIBCFG_SLED1)
#define PDMA_SLED1                PDMA_CH1                      /*!< SLED1 PDMA channel number              */
#endif

#if (LIBCFG_AES)
#define PDMA_AES_OUT              PDMA_CH4                      /*!< AES_OUT PDMA channel number            */
#define PDMA_AES_IN               PDMA_CH5                      /*!< AES_IN PDMA channel number             */
#endif

#if (LIBCFG_MIDI)
#define PDMA_MIDI_IN              PDMA_CH3                      /*!< MIDI_IN PDMA channel number            */
#define PDMA_MIDI_OUT             PDMA_CH4                      /*!< MIDI_OUT PDMA channel number           */
#endif

#if (LIBCFG_CORDIC)
#define PDMA_CORDIC_WR            PDMA_CH4                      /*!< CORDIC_WR PDMA channel number          */
#define PDMA_CORDIC_RD            PDMA_CH5                      /*!< CORDIC_RD PDMA channel number          */
#endif

/* flag                                                                                                     */
#define PDMA_FLAG_GE              (1UL << 0)                    /*!< PDMA channel global event flag         */
#define PDMA_FLAG_BE              (1UL << 1)                    /*!< PDMA channel block end flag            */
#define PDMA_FLAG_HT              (1UL << 2)                    /*!< PDMA channel half transfer flag        */
#define PDMA_FLAG_TC              (1UL << 3)                    /*!< PDMA channel transfer complete flag    */
#define PDMA_FLAG_TE              (1UL << 4)                    /*!< PDMA channel transfer error flag       */

#define IS_PDMA_FLAG(FLAG)        (((FLAG & 0xFFFFFFE0) == 0) && (FLAG != 0))
#define IS_PDMA_CLEAR_FLAG(FLAG)  (((FLAG & 0xFFFFFFE0) == 0) && (FLAG != 0))

/* interrupt                                                                                                */
#define PDMA_INT_GE               (1UL << 0)                  /*!< PDMA channel global event interrupt      */
#define PDMA_INT_BE               (1UL << 1)                  /*!< PDMA channel block end interrupt         */
#define PDMA_INT_HT               (1UL << 2)                  /*!< PDMA channel half transfer interrupt     */
#define PDMA_INT_TC               (1UL << 3)                  /*!< PDMA channel transfer complete interrupt */
#define PDMA_INT_TE               (1UL << 4)                  /*!< PDMA channel transfer error interrupt    */

#define IS_PDMA_INT(INT)          (((INT & 0xFFFFFFE0) == 0) && (INT != 0))
/**
  * @}
  */

/* Exported functions --------------------------------------------------------------------------------------*/
/** @defgroup PDMA_Exported_Functions PDMA exported functions
  * @{
  */
void PDMA_DeInit(void);
void PDMA_Config(u32 PDMA_CHn, PDMACH_InitTypeDef *PDMACH_InitStruct);
void PDMA_AddrConfig(u32 PDMA_CHn, u32 SrcAddr, u32 DstAddr);
void PDMA_SrcAddrConfig(u32 PDMA_CHn, u32 SrcAddr);
void PDMA_DstAddrConfig(u32 PDMA_CHn, u32 DstAddr);
void PDMA_TranSizeConfig(u32 PDMA_CHn, u16 BlkCnt, u16 BlkLen);
void PDMA_EnaCmd(u32 PDMA_CHn, ControlStatus NewState);
void PDMA_SwTrigCmd(u32 PDMA_CHn, ControlStatus NewState);

void PDMA_IntConfig(u32 PDMA_CHn, u32 PDMA_INT_x, ControlStatus NewState);
FlagStatus PDMA_GetFlagStatus(u32 PDMA_CHn, u32 PDMA_FLAG_x);
void PDMA_ClearFlag(u32 PDMA_CHn, u32 PDMA_FLAG_x);
u16 PDMA_GetRemainBlkCnt(u32 PDMA_CHn);
/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif
